=== OPTIMIZED CRUD PERFORMANCE BENCHMARKS (SCALE: 100000) ===
ğŸ“ PHASE 3: EXTENDED CRUD Operations
ğŸ” PostgreSQL CRUD Tests:
  â• CREATE (INSERT) test...
    âœ… INSERT Duration: 53ms, Records: 1, Throughput: 18 rps
  ğŸ” READ (SELECT) test...
    âœ… SELECT with JOIN Duration: 53ms, Records: 1, Throughput: 18 rps
  ğŸ” READ (SELECT selective) test...
    âœ… SELECT SELECTIVE Duration: 52ms, Records: 1, Throughput: 19 rps
  âœï¸ UPDATE test...
    âœ… UPDATE Duration: 54ms, Records: 1, Throughput: 18 rps
  ğŸ—‘ï¸ DELETE test...
    âœ… DELETE Duration: 53ms, Records: 1, Throughput: 18 rps
  ğŸš€ BULK Operations test (10 individual inserts)...
    âœ… BULK INSERT (10 records) Duration: 534ms, Throughput: 18 rps
ğŸ” OPTIMIZED HBase CRUD Tests:
  â• CREATE (PUT) test - OPTIMIZED...
hbase:001:0> put 'soalUjian', '9ad311e6-f112-42b9-86ea-68955243b637', 'main:idSoalUjian', '9ad311e6-f112-42b9-86ea-68955243b637'
Took 0.4058 seconds
hbase:002:0> put 'soalUjian', '9ad311e6-f112-42b9-86ea-68955243b637', 'main:namaUjian', 'CRUD Test 100000'
Took 0.0035 seconds
hbase:003:0> put 'soalUjian', '9ad311e6-f112-42b9-86ea-68955243b637', 'main:pertanyaan', 'Test CRUD question for scale 100000'
Took 0.0039 seconds
hbase:004:0> put 'soalUjian', '9ad311e6-f112-42b9-86ea-68955243b637', 'main:jenisSoal', 'PG'
Took 0.0041 seconds
hbase:005:0> put 'soalUjian', '9ad311e6-f112-42b9-86ea-68955243b637', 'main:bobot', '5'
Took 0.0041 seconds
hbase:006:0> put 'soalUjian', '9ad311e6-f112-42b9-86ea-68955243b637', 'main:jawabanBenar', '["A"]'
Took 0.0048 seconds
hbase:007:0> put 'soalUjian', '9ad311e6-f112-42b9-86ea-68955243b637', 'main:opsi', '{"A":"Option A"}'
Took 0.0028 seconds
hbase:008:0> put 'soalUjian', '9ad311e6-f112-42b9-86ea-68955243b637', 'refs:idTaksonomi', '54c1ac71-950a-4650-a2c2-7b648966a677'
Took 0.0025 seconds
hbase:009:0> put 'soalUjian', '9ad311e6-f112-42b9-86ea-68955243b637', 'refs:idKonsentrasiSekolah', '5aa7898c-84fa-47c0-be0a-f2d01afa506f'
Took 0.0024 seconds
hbase:010:0> put 'soalUjian', '9ad311e6-f112-42b9-86ea-68955243b637', 'detail:createdBy', 'CRUDTester'
Took 0.0024 seconds
hbase:011:0> exit
    âœ… BATCH PUT Duration: 6150ms, Records: 1, Throughput: 0 rps
  ğŸ” READ (GET) test - OPTIMIZED...
    âœ… GET Duration: 6030ms, Records: 1, Throughput: 0 rps
  ğŸ” READ (GET selective) test...
    âœ… GET SELECTIVE Duration: 6042ms, Records: 1, Throughput: 0 rps
  âœï¸ UPDATE test - OPTIMIZED...
hbase:001:0> put 'soalUjian', '9ad311e6-f112-42b9-86ea-68955243b637', 'main:pertanyaan', 'Updated: Test CRUD question for scale 100000'
Took 0.3932 seconds
hbase:002:0> put 'soalUjian', '9ad311e6-f112-42b9-86ea-68955243b637', 'main:bobot', '10'
Took 0.0025 seconds
hbase:003:0> exit
    âœ… BATCH UPDATE Duration: 6063ms, Records: 1, Throughput: 0 rps
  ğŸ—‘ï¸ DELETE test - OPTIMIZED...
hbase:001:0> deleteall 'soalUjian', '9ad311e6-f112-42b9-86ea-68955243b637'
Took 0.4287 seconds
hbase:002:0> exit
    âœ… DELETE Duration: 6016ms, Records: 1, Throughput: 0 rps
  ğŸš€ BULK Operations test (mini batch)...
hbase:001:0> put 'soalUjian', 'cc11215f-3476-4ab7-adef-b745aefbe347', 'main:idSoalUjian', 'cc11215f-3476-4ab7-adef-b745aefbe347'
Took 0.3989 seconds
hbase:002:0> put 'soalUjian', 'cc11215f-3476-4ab7-adef-b745aefbe347', 'main:namaUjian', 'Bulk Test 1'
Took 0.0026 seconds
hbase:003:0> put 'soalUjian', 'cc11215f-3476-4ab7-adef-b745aefbe347', 'main:pertanyaan', 'Bulk question 1 for scale 100000'
Took 0.0050 seconds
hbase:004:0> put 'soalUjian', 'cc11215f-3476-4ab7-adef-b745aefbe347', 'main:jenisSoal', 'PG'
Took 0.0048 seconds
hbase:005:0> put 'soalUjian', 'cc11215f-3476-4ab7-adef-b745aefbe347', 'main:bobot', '1'
Took 0.0027 seconds
hbase:006:0> put 'soalUjian', 'be3c9f17-9c30-4cb2-8185-e60683cbffd7', 'main:idSoalUjian', 'be3c9f17-9c30-4cb2-8185-e60683cbffd7'
Took 0.0030 seconds
hbase:007:0> put 'soalUjian', 'be3c9f17-9c30-4cb2-8185-e60683cbffd7', 'main:namaUjian', 'Bulk Test 2'
Took 0.0023 seconds
hbase:008:0> put 'soalUjian', 'be3c9f17-9c30-4cb2-8185-e60683cbffd7', 'main:pertanyaan', 'Bulk question 2 for scale 100000'
Took 0.0024 seconds
hbase:009:0> put 'soalUjian', 'be3c9f17-9c30-4cb2-8185-e60683cbffd7', 'main:jenisSoal', 'PG'
Took 0.0021 seconds
hbase:010:0> put 'soalUjian', 'be3c9f17-9c30-4cb2-8185-e60683cbffd7', 'main:bobot', '2'
Took 0.0026 seconds
hbase:011:0> put 'soalUjian', '29ef2601-32de-4a20-935d-c3bb203b055d', 'main:idSoalUjian', '29ef2601-32de-4a20-935d-c3bb203b055d'
Took 0.0022 seconds
hbase:012:0> put 'soalUjian', '29ef2601-32de-4a20-935d-c3bb203b055d', 'main:namaUjian', 'Bulk Test 3'
Took 0.0022 seconds
hbase:013:0> put 'soalUjian', '29ef2601-32de-4a20-935d-c3bb203b055d', 'main:pertanyaan', 'Bulk question 3 for scale 100000'
Took 0.0034 seconds
hbase:014:0> put 'soalUjian', '29ef2601-32de-4a20-935d-c3bb203b055d', 'main:jenisSoal', 'PG'
Took 0.0040 seconds
hbase:015:0> put 'soalUjian', '29ef2601-32de-4a20-935d-c3bb203b055d', 'main:bobot', '3'
Took 0.0024 seconds
hbase:016:0> put 'soalUjian', '40a68c09-be51-4360-95db-cbf7e7f25ddb', 'main:idSoalUjian', '40a68c09-be51-4360-95db-cbf7e7f25ddb'
Took 0.0029 seconds
hbase:017:0> put 'soalUjian', '40a68c09-be51-4360-95db-cbf7e7f25ddb', 'main:namaUjian', 'Bulk Test 4'
Took 0.0031 seconds
hbase:018:0> put 'soalUjian', '40a68c09-be51-4360-95db-cbf7e7f25ddb', 'main:pertanyaan', 'Bulk question 4 for scale 100000'
Took 0.0028 seconds
hbase:019:0> put 'soalUjian', '40a68c09-be51-4360-95db-cbf7e7f25ddb', 'main:jenisSoal', 'PG'
Took 0.0026 seconds
hbase:020:0> put 'soalUjian', '40a68c09-be51-4360-95db-cbf7e7f25ddb', 'main:bobot', '4'
Took 0.0022 seconds
hbase:021:0> put 'soalUjian', '22220a8a-2704-4770-a2ab-02bb063ac563', 'main:idSoalUjian', '22220a8a-2704-4770-a2ab-02bb063ac563'
Took 0.0021 seconds
hbase:022:0> put 'soalUjian', '22220a8a-2704-4770-a2ab-02bb063ac563', 'main:namaUjian', 'Bulk Test 5'
Took 0.0022 seconds
hbase:023:0> put 'soalUjian', '22220a8a-2704-4770-a2ab-02bb063ac563', 'main:pertanyaan', 'Bulk question 5 for scale 100000'
Took 0.0022 seconds
hbase:024:0> put 'soalUjian', '22220a8a-2704-4770-a2ab-02bb063ac563', 'main:jenisSoal', 'PG'
Took 0.0021 seconds
hbase:025:0> put 'soalUjian', '22220a8a-2704-4770-a2ab-02bb063ac563', 'main:bobot', '5'
Took 0.0021 seconds
hbase:026:0> put 'soalUjian', 'cbc79bb3-17bf-47a9-a787-cd9e107377d0', 'main:idSoalUjian', 'cbc79bb3-17bf-47a9-a787-cd9e107377d0'
Took 0.0038 seconds
hbase:027:0> put 'soalUjian', 'cbc79bb3-17bf-47a9-a787-cd9e107377d0', 'main:namaUjian', 'Bulk Test 6'
Took 0.0024 seconds
hbase:028:0> put 'soalUjian', 'cbc79bb3-17bf-47a9-a787-cd9e107377d0', 'main:pertanyaan', 'Bulk question 6 for scale 100000'
Took 0.0042 seconds
hbase:029:0> put 'soalUjian', 'cbc79bb3-17bf-47a9-a787-cd9e107377d0', 'main:jenisSoal', 'PG'
Took 0.0028 seconds
hbase:030:0> put 'soalUjian', 'cbc79bb3-17bf-47a9-a787-cd9e107377d0', 'main:bobot', '6'
Took 0.0022 seconds
hbase:031:0> put 'soalUjian', 'c1353390-e131-4ed3-aacf-adb5785a965d', 'main:idSoalUjian', 'c1353390-e131-4ed3-aacf-adb5785a965d'
Took 0.0021 seconds
hbase:032:0> put 'soalUjian', 'c1353390-e131-4ed3-aacf-adb5785a965d', 'main:namaUjian', 'Bulk Test 7'
Took 0.0020 seconds
hbase:033:0> put 'soalUjian', 'c1353390-e131-4ed3-aacf-adb5785a965d', 'main:pertanyaan', 'Bulk question 7 for scale 100000'
Took 0.0021 seconds
hbase:034:0> put 'soalUjian', 'c1353390-e131-4ed3-aacf-adb5785a965d', 'main:jenisSoal', 'PG'
Took 0.0022 seconds
hbase:035:0> put 'soalUjian', 'c1353390-e131-4ed3-aacf-adb5785a965d', 'main:bobot', '7'
Took 0.0020 seconds
hbase:036:0> put 'soalUjian', 'b31f8c55-2ac4-4c73-b0d1-9ed6c4a89a32', 'main:idSoalUjian', 'b31f8c55-2ac4-4c73-b0d1-9ed6c4a89a32'
Took 0.0021 seconds
hbase:037:0> put 'soalUjian', 'b31f8c55-2ac4-4c73-b0d1-9ed6c4a89a32', 'main:namaUjian', 'Bulk Test 8'
Took 0.0020 seconds
hbase:038:0> put 'soalUjian', 'b31f8c55-2ac4-4c73-b0d1-9ed6c4a89a32', 'main:pertanyaan', 'Bulk question 8 for scale 100000'
Took 0.0016 seconds
hbase:039:0> put 'soalUjian', 'b31f8c55-2ac4-4c73-b0d1-9ed6c4a89a32', 'main:jenisSoal', 'PG'
Took 0.0015 seconds
hbase:040:0> put 'soalUjian', 'b31f8c55-2ac4-4c73-b0d1-9ed6c4a89a32', 'main:bobot', '8'
Took 0.0015 seconds
hbase:041:0> put 'soalUjian', '19ac5ea3-ba34-4366-ac10-a2bd035f151e', 'main:idSoalUjian', '19ac5ea3-ba34-4366-ac10-a2bd035f151e'
Took 0.0016 seconds
hbase:042:0> put 'soalUjian', '19ac5ea3-ba34-4366-ac10-a2bd035f151e', 'main:namaUjian', 'Bulk Test 9'
Took 0.0015 seconds
hbase:043:0> put 'soalUjian', '19ac5ea3-ba34-4366-ac10-a2bd035f151e', 'main:pertanyaan', 'Bulk question 9 for scale 100000'
Took 0.0016 seconds
hbase:044:0> put 'soalUjian', '19ac5ea3-ba34-4366-ac10-a2bd035f151e', 'main:jenisSoal', 'PG'
Took 0.0017 seconds
hbase:045:0> put 'soalUjian', '19ac5ea3-ba34-4366-ac10-a2bd035f151e', 'main:bobot', '9'
Took 0.0016 seconds
hbase:046:0> put 'soalUjian', 'bbdec150-e2c1-47c1-88cd-e7dffb6da5ce', 'main:idSoalUjian', 'bbdec150-e2c1-47c1-88cd-e7dffb6da5ce'
Took 0.0016 seconds
hbase:047:0> put 'soalUjian', 'bbdec150-e2c1-47c1-88cd-e7dffb6da5ce', 'main:namaUjian', 'Bulk Test 10'
Took 0.0015 seconds
hbase:048:0> put 'soalUjian', 'bbdec150-e2c1-47c1-88cd-e7dffb6da5ce', 'main:pertanyaan', 'Bulk question 10 for scale 100000'
Took 0.0015 seconds
hbase:049:0> put 'soalUjian', 'bbdec150-e2c1-47c1-88cd-e7dffb6da5ce', 'main:jenisSoal', 'PG'
Took 0.0014 seconds
hbase:050:0> put 'soalUjian', 'bbdec150-e2c1-47c1-88cd-e7dffb6da5ce', 'main:bobot', '10'
Took 0.0015 seconds
hbase:051:0> exit
    âœ… BULK INSERT (10 records) Duration: 6407ms, Throughput: 1 rps
hbase:001:0> deleteall 'soalUjian', 'cc11215f-3476-4ab7-adef-b745aefbe347'
Took 0.3997 seconds
hbase:002:0> deleteall 'soalUjian', 'be3c9f17-9c30-4cb2-8185-e60683cbffd7'
Took 0.0024 seconds
hbase:003:0> deleteall 'soalUjian', '29ef2601-32de-4a20-935d-c3bb203b055d'
Took 0.0022 seconds
hbase:004:0> deleteall 'soalUjian', '40a68c09-be51-4360-95db-cbf7e7f25ddb'
Took 0.0032 seconds
hbase:005:0> deleteall 'soalUjian', '22220a8a-2704-4770-a2ab-02bb063ac563'
Took 0.0022 seconds
hbase:006:0> deleteall 'soalUjian', 'cbc79bb3-17bf-47a9-a787-cd9e107377d0'
Took 0.0040 seconds
hbase:007:0> deleteall 'soalUjian', 'c1353390-e131-4ed3-aacf-adb5785a965d'
Took 0.0033 seconds
hbase:008:0> deleteall 'soalUjian', 'b31f8c55-2ac4-4c73-b0d1-9ed6c4a89a32'
Took 0.0026 seconds
hbase:009:0> deleteall 'soalUjian', '19ac5ea3-ba34-4366-ac10-a2bd035f151e'
Took 0.0055 seconds
hbase:010:0> deleteall 'soalUjian', 'bbdec150-e2c1-47c1-88cd-e7dffb6da5ce'
Took 0.0030 seconds
hbase:011:0> exit
âœ… EXTENDED CRUD benchmarks completed for scale 100000

ğŸ“ EXTENDED CRUD PERFORMANCE SUMMARY (Scale: 100000)
====================================================

PostgreSQL CRUD :
  - â• INSERT: Single record with FK
  - ğŸ” SELECT: With JOIN operations
  - ğŸ” SELECT SELECTIVE: Specific columns only
  - âœï¸ UPDATE: Single record update
  - ğŸ—‘ï¸ DELETE: Single record delete
  - ğŸš€ BULK: 10 records individual inserts

HBase CRUD:
  - â• BATCH PUT: Multi-column family (10 operations in 1 session)
  - ğŸ” GET: All column families 
  - ğŸ” GET SELECTIVE: Specific columns only
  - âœï¸ BATCH UPDATE: Multiple fields (2 operations in 1 session)
  - ğŸ—‘ï¸ DELETE: Complete row delete 
  - ğŸš€ BULK: 10 records batch insert test

